Repository: jaimisdomadiya/flutter_localization
Catalog: lib/l10n/intl_*.arb
Languages: ar, hi

# welcomeText
source: Hi welcome
ar: اهلا اهلا وسهلا
hi: स्वागत है

# welcome_msg
source: Welcome to this app
ar: مرحبا بكم في هذا التطبيق
hi: इस ऐप में आपका स्वागत है

source: where are you
ar: أين أنت
hi: खा पर हो

source: good morning
ar: صباح الخير
hi: शुभ प्रभात

source: welcome back
ar: مرحبا بعودتك
hi: वापसी पर स्वागत है

source: Hello
ar: مرحبا
hi: नमस्ते

source: Story
ar: قصة
hi: कहानी

source: Read Story
ar: قراءة القصة
hi: कहानी पढ़ें

source: History of Hindi
ar: تاريخ الهندية
hi: हिंदी का इतिहास

source: Change Language
ar: تغيير اللغة
hi: भाषा बदलें

source: Description
ar: وصف
hi: विवरण

# history_taught_1
source: May your language progress, the root of all progress|
ar: نرجو أن تتقدم لغتك ، أصل كل تقدم |
hi: निज भाषा उन्नति रहे, सब उन्नति के मूल|

# history_taught_2
source: Without knowledge, without being foolish, foolish||
ar: بدون علم وبدون حماقة بلا حماقة ||
hi: बिनु निज भाषा ज्ञान के, रहत मूढ़-के-मूढ़||

# hindi_description_1
source: The official language of the Union shall be Hindi in Devanagari script. The form of numerals to be used for the official purposes of the Union shall be the international form of Indian numerals.
ar: يجب أن تكون اللغة الرسمية للاتحاد هي الهندية بالخط الديفاناغاري. يجب أن يكون شكل الأرقام الذي سيتم استخدامه للأغراض الرسمية للاتحاد هو الشكل الدولي للأرقام الهندية.
hi: संघ की राजभाषा देवनागरी लिपि में हिन्दी होगी। संघ के आधिकारिक उद्देश्यों के लिए उपयोग किए जाने वाले अंकों का रूप भारतीय अंकों का अंतर्राष्ट्रीय रूप होगा।

# hindi_description_2
source: Notwithstanding anything in clause (1), for a period of fifteen years from the commencement of this Constitution, the English language shall continue to be used for all the official purposes of the Union for which it was being used immediately before such commencement: Provided that the President may, during the said period, by order authorise the use of the Hindi language in addition to the English language and of the Devanagari form of numerals in addition to the international form of Indian numerals for any of the official purposes of the Union
ar: بصرف النظر عن أي شيء وارد في البند (1) ، لمدة خمسة عشر عامًا من بدء هذا الدستور ، يجب الاستمرار في استخدام اللغة الإنجليزية لجميع الأغراض الرسمية للاتحاد الذي تم استخدامه من أجله مباشرة قبل هذا البدء: يجوز للرئيس ، خلال الفترة المذكورة ، بأمر أن يأذن باستخدام اللغة الهندية بالإضافة إلى اللغة الإنجليزية وشكل الديفاناغاري من الأرقام بالإضافة إلى الشكل الدولي للأرقام الهندية لأي من الأغراض الرسمية للاتحاد
hi: खंड (1) में किसी बात के होते हुए भी, इस संविधान के प्रारंभ से पंद्रह वर्ष की अवधि के लिए, अंग्रेजी भाषा का उपयोग संघ के उन सभी आधिकारिक उद्देश्यों के लिए किया जाता रहेगा जिसके लिए इसका उपयोग ऐसे प्रारंभ से ठीक पहले किया जा रहा था: बशर्ते कि राष्ट्रपति, उक्त अवधि के दौरान, संघ के किसी भी आधिकारिक उद्देश्यों के लिए भारतीय अंकों के अंतर्राष्ट्रीय रूप के अलावा अंग्रेजी भाषा के अलावा हिंदी भाषा और अंकों के देवनागरी रूप के उपयोग को अधिकृत कर सकते हैं।

# story_1
source: Once, there was a boy who became bored when he watched over the village sheep grazing on the hillside.
ar: ذات مرة ، كان هناك صبي يشعر بالملل عندما يراقب أغنام القرية التي ترعى على سفح التل.
hi: एक बार, एक लड़का था जो पहाड़ी पर चरते गाँव की भेड़ों को देखकर ऊब गया था।

# story_2
source: To entertain himself, he sang out, “Wolf! Wolf! The wolf is chasing the sheep!”
ar: للترفيه عن نفسه ، غنى ، "الذئب! ذئب! الذئب يطارد الخراف! "
hi: अपना मनोरंजन करने के लिए, उन्होंने गाया, “भेड़िया! भेड़िया! भेड़िया भेड़ का पीछा कर रहा है!”

# story_3
source: When the villagers heard the cry, they came running up the hill to drive the wolf away. But, when they arrived, they saw no wolf. The boy was amused when seeing their angry faces.
ar: عندما سمع القرويون الصرخة ، جاءوا وهم يركضون أعلى التل لإبعاد الذئب. لكن عندما وصلوا ، لم يروا ذئبًا. كان الصبي مسليا عندما رأى وجوههم الغاضبة.
hi: जब ग्रामीणों ने चीख सुनी, तो वे भेड़िये को भगाने के लिए पहाड़ी पर दौड़ते हुए आए। लेकिन, जब वे पहुंचे, तो उन्होंने कोई भेड़िया नहीं देखा। उनके गुस्से वाले चेहरों को देखकर लड़का खुश हो गया।

# story_4
source: “Don’t scream wolf, boy,” warned the villagers, “when there is no wolf!” They angrily went back down the hill.
ar: "لا تصرخ يا ذئب ، يا فتى ،" حذر القرويين ، "عندما لا يكون هناك ذئب!" عادوا بغضب إلى أسفل التل.
hi: "भेड़िया चिल्लाओ मत, लड़का," ग्रामीणों को चेतावनी दी, "जब कोई भेड़िया नहीं है!" वे गुस्से में वापस पहाड़ी पर चले गए।

# story_5
source: Later, the shepherd boy cried out once again, “Wolf! Wolf! The wolf is chasing the sheep!” To his amusement, he looked on as the villagers came running up the hill to scare the wolf away.
ar: فيما بعد صرخ الراعي مرة أخرى ، "ذئب! ذئب! الذئب يطارد الخراف! " من أجل تسليته ، نظر إلى القرويين وهم يركضون صاعدًا التل لإخافة الذئب بعيدًا.
hi: बाद में, चरवाहा लड़का एक बार फिर चिल्लाया, “भेड़िया! भेड़िया! भेड़िया भेड़ का पीछा कर रहा है!” अपने मनोरंजन के लिए, उसने देखा कि ग्रामीण भेड़िये को डराने के लिए पहाड़ी पर दौड़ते हुए आए हैं।
